{
  "en": {
    "description": [
      "I'm a passionate frontend developer with 5+ years of experience creating engaging digital experiences that users love.",
      "My journey in web development started with a curiosity about how websites work. Today, I specialize in React, Next.js, and modern frontend technologies to build scalable, performant applications.",
      "I believe in writing clean, maintainable code and creating intuitive user interfaces that solve real problems. When I'm not coding, you'll find me exploring new technologies, contributing to open source, or mentoring aspiring developers."
    ],
    "skills": [
      "React",
      "Next.js",
      "TypeScript",
      "Tailwind CSS",
      "Figma"
    ],
    "features": [
      {
        "icon": "Code",
        "title": "Clean Code",
        "description": "Writing maintainable, scalable code that follows best practices and industry standards."
      },
      {
        "icon": "Palette",
        "title": "UI/UX Focus",
        "description": "Creating beautiful, intuitive interfaces that provide exceptional user experiences."
      },
      {
        "icon": "Zap",
        "title": "Performance",
        "description": "Optimizing applications for speed, accessibility, and seamless user interactions."
      }
    ]
  },
  "fa": {
    "description": [
      "من یک توسعه‌دهنده فرانت‌اند پرشور با بیش از ۵ سال تجربه در خلق تجربه‌های دیجیتالی جذاب هستم که کاربران آن‌ها را دوست دارند.",
      "سفر من در دنیای توسعه وب با کنجکاوی درباره‌ی چگونگی عملکرد وب‌سایت‌ها آغاز شد. امروز من در React، Next.js و تکنولوژی‌های مدرن فرانت‌اند تخصص دارم تا اپلیکیشن‌های مقیاس‌پذیر و پرسرعت بسازم.",
      "من به نوشتن کد تمیز و قابل نگهداری و طراحی رابط‌های کاربری شهودی که مشکلات واقعی را حل می‌کنند، معتقدم. زمانی که در حال کدنویسی نیستم، در حال کشف تکنولوژی‌های جدید، مشارکت در پروژه‌های متن‌باز یا راهنمایی توسعه‌دهندگان تازه‌کار هستم."
    ],
    "skills": [
      "ری‌اکت",
      "نکست‌جی‌اس",
      "تایپ‌ اسکریپت",
      "تِیل‌ویند",
      "فیگما"
    ],
    "features": [
      {
        "icon": "Code",
        "title": "کدنویسی تمیز",
        "description": "نوشتن کدی مقیاس‌پذیر و قابل نگهداری با رعایت استانداردهای روز و بهترین شیوه‌ها."
      },
      {
        "icon": "Palette",
        "title": "تمرکز بر UI/UX",
        "description": "ایجاد رابط‌های کاربری زیبا و شهودی برای تجربه‌ی کاربری بی‌نظیر."
      },
      {
        "icon": "Zap",
        "title": "عملکرد بالا",
        "description": "بهینه‌سازی اپلیکیشن‌ها برای سرعت، دسترسی‌پذیری، و تعامل روان کاربر."
      }
    ]
  }
}